<template>
  <div class="container mb-3">
    <MDBCard>
      <MDBCardHeader class="bg-success text-center text-light">
        <img class="mb-3" style="height: 150px" :src="trophy" />
        <h4 style="font-weight: bolder" class="mb-0 text-header">
          STORYKEEPER PHILOSOPHY
        </h4>
        <small class="mb-0 text-header">Everyone has a story to tell.</small>
      </MDBCardHeader>
      <MDBCardBody class="p-5">
        <h4>ทุกคนมีเรื่องเล่า!</h4>
        <p class="mb-5">
          ไม่ว่าคุณจะเป็นใคร วัยไหน ทำงานอะไร จะเป็น นักเรียน พนักงานออฟฟิศ
          นักบิน นางแบบ … เราเชื่อว่าทุกๆ ชีวิตย่อมมีเรื่องราวที่อยากบอกต่อเสมอ
          StoryKeeper จึงถือกำเนิดขึ้น เพื่อเป็นพื้นที่รวบรวม เรื่องราวของทุกคน
          ไม่ว่าจะเป็น ประสบการณ์ชีวิต ความรู้ และก้อนความคิดที่อยากจะส่งต่อ
          เพื่อเป็นแรงบันดาลใจ
          หรืออย่างน้อยก็ช่วยสร้างรอยยิ้มที่เปลี่ยนวันเศร้าๆ
          ให้กลายเป็นวันที่สดใสให้หลายๆ คนได้
        </p>
        <h4>เรื่องราวดีๆ ไม่ควรมีวันหมดอายุ</h4>
        <p class="mb-5">
          StoryKeeper อยากจะเป็นอีกช่องทางให้ทุกคนได้ส่งต่อและเก็บเรื่องราวไว้
          ไม่ให้ตายไปตามกาลเวลา นอกจากจะ ค้นหาเรื่องได้จากระบบ Full-text search
          และ Hashtag แล้ว เรายังพยายามดึง เรื่องราวๆ ดีๆ กลับขึ้นมาให้คนได้อ่าน
          อยู่เสมอ ดังนั้นเราจึงไม่ปิดกั้น
          ถ้าคุณจะนำบันทึกหรือไดอารี่ที่เคยจดไว้ จาก Blog ที่เคยเขียน หรือแม้แต่
          สเตตัส Facebookเก่าๆ ที่เคยโพสต์ไว้ ถ้าไม่อยากให้ตกหายไปใน feed
          สามารถนำมาเก็บไว้ที่นี่
        </p>

        <h4>ไม่ต้องเป็น “นักเขียน” ก็ “เขียน” ได้</h4>
        <p class="mb-5">
          เราสร้างที่นี่เพื่อให้ทุกคนได้มาเล่าเรื่อง เก็บเรื่องราว
          เรื่องที่อยากบอก เรื่องที่อยากระบาย เรื่องที่อยากบันทึก
          ไม่ต้องไปสนว่าต้องมีคนอ่านมากมาย มันคือพื้นที่ของเรา…
          เป็นหนังสือที่ทำให้เรายิ้มออกได้เสมอ เมื่อพลิกมันกลับมาอ่าน
          ถ้ามันจะมีซักบทในหนังสือ ที่มันจะเข้าถึงหลายๆ คนได้ คนชอบเยอะ อ่านเยอะ
          แชร์เยอะ ก็ถือว่าเป็นโบนัส
        </p>

        <h4>เล่าเรื่องอะไรได้บ้าง?</h4>

        <p class="mb-5">
          คุณสามารถเล่าเรื่องได้อิสระ จะเป็นประสบการณ์ที่ได้เจอมา
          เรื่องตลกเปิ่นๆ โมเม้นรักกุ๊กกิ๊ก เหตุการณ์จุดเปลี่ยนชีวิต
          หรือไม่ว่าจะเป็นทัศนคติ ความคิดเห็นต่อสิ่งที่ได้ไปเจอมา
          อย่างไรก็ตามพวกเราสนับสนุนให้ใช้เรื่องราว ในการ “สร้างสรรค์”
          เปิดมุมมองใหม่ แชร์ความสนุก ความตื่นเต้น เสียงหัวเราะ
          ไม่ใช่เพื่อว่าร้ายโจมตีบุคคลที่สามในด้านลบ
        </p>

        <h4>สนับสนุนเส้นทางนักเขียนอาชีพ</h4>
        <p class="m-0">
          เราขับเคลื่อนไปทีละก้าว
          เริ่มแรกเราแค่อยากให้ทุกคนได้เล่าได้เขียนได้อย่างไม่มีกำแพง
          ก้าวต่อไปเราจะสนับสนุนผู้ที่อยากเป็น “นักเขียน”
          ให้ได้ออกผลงานสู่ตลาดได้ง่ายขึ้น จะทั้งการรวมเล่ม การทำ E-book
          และแคมเปญต่างๆ ที่เรากำลังผลักดัน เราหวังว่าในไม่ช้า StoryKeeper
          จะเป็นพื้นที่อีกแห่งที่จะผลักดัน Community นักเขียนให้แข็งแกร่ง
          สร้างช่องทาง, สร้างรายได้ และ สร้างอาชีพให้กับนักเขียนได้จริงๆ
        </p>
      </MDBCardBody>
    </MDBCard>
  </div>
</template>
<script setup>
import { MDBCard, MDBCardBody, MDBCardHeader } from "mdb-vue-ui-kit";
import trophy from "@/assets/trophy.png";
</script>
<style scoped>
.card {
  margin-top: -15.3em;
}
.card-header {
  backdrop-filter: blur(5px);
}
.text-header {
  letter-spacing: 2.6px;
}
</style>
